/*-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
    
    敵オブジェクト

  -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-*/
phina.define("Enemy",
  {
    /*---=---=---=---=---=---=---=---=---=---=---=---=---=---=---=---
      
        コンストラクタ

      ---=---=---=---=---=---=---=---=---=---=---=---=---=---=---=---*/
    init: function (敵データ)
    {
      this.名前 = 敵データ.名前;
      this.現在体力 = 0;
      this.基礎体力 = 敵データ.基礎体力;
      this.基礎機動力 = 敵データ.基礎機動力;
      this.攻撃力 = 敵データ.基礎攻撃力;
      this.属性値 = 敵データ.基礎属性値;
      this.基礎防御力 = 敵データ.基礎防御力;
      this.基礎属性耐性 = 敵データ.基礎属性耐性;
      this.状態異常耐性 = 敵データ.状態異常耐性;
      this.状態異常値蓄積値 =
      {
        "毒": 0,
        "麻痺": 0,
        "睡眠": 0
      }
      this.怒り値 = 敵データ.怒り値;
      this.疲労値 = 敵データ.疲労値;
      this.怒り蓄積値 = 0;
      this.疲労蓄積値 = 0;
      this.行動 = 敵データ.行動;
      this.取得経験値 = 敵データ.取得経験値;
      this.ドロップ素材 = 敵データ.ドロップ素材;
      this.テキスト = 敵データ.テキスト;
      this.アイコン = 敵データ.アイコン;
      this.バフ = new Array();
      this.デバフ = new Array();

      this.最大体力 = function ()
      {
        let 最大体力 = this.基礎体力;
        return 最大体力;
      }

      this.機動力 = function ()
      {
        let 機動力 = this.基礎機動力;
        return 機動力;
      }

      this.防御力 = function ()
      {
        let 防御力 = this.基礎防御力;
        return 防御力;
      }

      this.属性耐性 = function ()
      {
        let 属性耐性 = this.基礎属性耐性;
        return 属性耐性;
      }

      this.威力 = function (技名)
      {
        let 威力 =
        {
          "物理": 0,
          "属性":
          {
            "火炎": 0,
            "水氷": 0,
            "風雷": 0,
            "土石": 0
          }
        };
        return 威力;
      }
    }
    /*---=---=---=---=---=---=---=---=---=---=---=---=---=---=---=---*/
  }
);
/*-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-*/

